In [2]:
#!pip install mysql-connector-python

In [2]:
import mysql.connector  		#importing database
database = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database = "pythonclass8am"
)
db = database.cursor()

In [4]:
db.execute("SELECT * FROM student")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Shyam', 78, 76, 90, 67, 89, 412, 82.5, 'A')
(2, 'Ram', 78, 87, 67, 89, 87, 450, 85.5, 'A+')
(5, 'Shyama', 78, 60, 75, 70, 78, 410, 81.4, 'A')
(8, 'Rama', 89, 78, 89, 67, 86, 400, 80.0, 'A')
(9, 'Ram', 89, 78, 89, 67, 86, 400, 80.0, 'A+')
(10, 'Ram', 89, 78, 89, 67, 86, 400, 80.0, 'A+')
(11, 'Sagar', 89, 87, 67, 89, 76, 408, 81.6, 'A+')
(15, 'Sabin', 89, 87, 90, 79, 80, 415, 83.0, 'A+')
(16, 'Nabin', 99, 97, 90, 99, 90, 480, 95.0, 'A+')
(17, 'Kabir', 99, 97, 90, 99, 90, 480, 95.0, 'A+')
(18, 'Abhinav', 89, 80, 90, 89, 78, 426, 85.2, 'A')
(20, 'Akash', 78, 56, 90, 45, 67, 410, 79.0, 'B')
(21, 'Nabin', 89, 67, 90, 78, 56, 390, 78.0, 'B')

In [5]:
#insert data into table
sql = ''' INSERT INTO `student` (`sn`, `name`, `physics`, `chemistry`, `math`, `english`, `nepali`, `total`, `per`, `grade`)
VALUES (24, 'Anusha', 78, 77, 99, 88, 87, 400, 78, B);'''
db.execute(sql)
database.commit()
print(db.rowcount, "record inserted.")

1 record inserted.

In [6]:
name = input("Enter name = ")
physics = int(input("Enter physics marks= "))
chemistry = int(input("Enter chemistry marks= "))
math = int(input("Enter math marks= "))
english = int(input("Enter english marks= "))
nepali = int(input("Enter nepali marks= "))

total = physics + chemistry + math + english + nepali
per = total/5

if per >= 80:
    grade = "A"
elif per >= 60:
    grade = "B"
elif per >= 45:
    grade = "C"
else:
    grade = "F"
    

#insert data into table
sql = f''' INSERT INTO student (name, physics, chemistry, math, english, nepali, total, per, grade)
        VALUES ('{name}', {physics}, {chemistry}, {math}, {english}, {nepali}, {total}, {per}, '{grade}')'''
db.execute(sql)
database.commit()
print(db.rowcount, "record inserted.")

Enter name =  Hari
Enter physics marks=  89
Enter chemistry marks=  87
Enter math marks=  90
Enter english marks=  78
Enter nepali marks=  76

1 record inserted.

In [3]:
# Update in sql
sql = "UPDATE student SET name = 'Rama' WHERE sn = 2"
db.execute(sql)
database.commit()
print(db.rowcount, "record(s) affected")

1 record(s) affected

In [ ]:
#Delete in sql
sql = "DELETE FROM student WHERE sn = 29"
db.execute(sql)
database.commit()
print(db.rowcount, "record(s) deleted")

In [4]:
# Select 
db.execute("SELECT * FROM student WHERE grade = 'A'")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Shyam', 78, 76, 90, 67, 89, 412, 82.5, 'A')
(5, 'Shyama', 78, 60, 75, 70, 78, 410, 81.4, 'A')
(8, 'Rama', 89, 78, 89, 67, 86, 400, 80.0, 'A')
(18, 'Abhinav', 89, 80, 90, 89, 78, 426, 85.2, 'A')
(25, 'Hari', 89, 87, 90, 78, 76, 420, 84.0, 'A')

In [5]:
# Select 
db.execute("SELECT * FROM student WHERE physics > 80")
result =db.fetchall()
for x in result:
    print(x)

(8, 'Rama', 89, 78, 89, 67, 86, 400, 80.0, 'A')
(9, 'Ram', 89, 78, 89, 67, 86, 400, 80.0, 'A+')
(10, 'Ram', 89, 78, 89, 67, 86, 400, 80.0, 'A+')
(11, 'Sagar', 89, 87, 67, 89, 76, 408, 81.6, 'A+')
(15, 'Sabin', 89, 87, 90, 79, 80, 415, 83.0, 'A+')
(16, 'Nabin', 99, 97, 90, 99, 90, 480, 95.0, 'A+')
(17, 'Kabir', 99, 97, 90, 99, 90, 480, 95.0, 'A+')
(18, 'Abhinav', 89, 80, 90, 89, 78, 426, 85.2, 'A')
(21, 'Nabin', 89, 67, 90, 78, 56, 390, 78.0, 'B')
(25, 'Hari', 89, 87, 90, 78, 76, 420, 84.0, 'A')

In [15]:
# search
db.execute("SELECT * FROM student WHERE name LIKE '%ram%'")
result =db.fetchall()
for x in result:
    print(x)

(2, 'Rama', 78, 87, 67, 89, 87, 450, 85.5, 'A+')
(8, 'Rama', 89, 78, 89, 67, 86, 400, 80.0, 'A')
(9, 'Ram', 89, 78, 89, 67, 86, 400, 80.0, 'A+')
(10, 'Ram', 89, 78, 89, 67, 86, 400, 80.0, 'A+')

In [17]:
# Select 
db.execute("SELECT * FROM student WHERE physics > 80 and chemistry=80")
result =db.fetchall()
for x in result:
    print(x)

(18, 'Abhinav', 89, 80, 90, 89, 78, 426, 85.2, 'A')

In [19]:
# Select 
db.execute("SELECT * FROM student WHERE physics >= 80 or chemistry>=80")
result =db.fetchall()
for x in result:
    print(x)

(2, 'Rama', 78, 87, 67, 89, 87, 450, 85.5, 'A+')
(8, 'Rama', 89, 78, 89, 67, 86, 400, 80.0, 'A')
(9, 'Ram', 89, 78, 89, 67, 86, 400, 80.0, 'A+')
(10, 'Ram', 89, 78, 89, 67, 86, 400, 80.0, 'A+')
(11, 'Sagar', 89, 87, 67, 89, 76, 408, 81.6, 'A+')
(15, 'Sabin', 89, 87, 90, 79, 80, 415, 83.0, 'A+')
(16, 'Nabin', 99, 97, 90, 99, 90, 480, 95.0, 'A+')
(17, 'Kabir', 99, 97, 90, 99, 90, 480, 95.0, 'A+')
(18, 'Abhinav', 89, 80, 90, 89, 78, 426, 85.2, 'A')
(21, 'Nabin', 89, 67, 90, 78, 56, 390, 78.0, 'B')
(25, 'Hari', 89, 87, 90, 78, 76, 420, 84.0, 'A')

In [20]:
# Select 
db.execute("SELECT name,total,per,grade FROM student")
result =db.fetchall()
for x in result:
    print(x)

('Shyam', 412, 82.5, 'A')
('Rama', 450, 85.5, 'A+')
('Shyama', 410, 81.4, 'A')
('Rama', 400, 80.0, 'A')
('Ram', 400, 80.0, 'A+')
('Ram', 400, 80.0, 'A+')
('Sagar', 408, 81.6, 'A+')
('Sabin', 415, 83.0, 'A+')
('Nabin', 480, 95.0, 'A+')
('Kabir', 480, 95.0, 'A+')
('Abhinav', 426, 85.2, 'A')
('Akash', 410, 79.0, 'B')
('Nabin', 390, 78.0, 'B')
('Nabin', 400, 78.0, 'B')
('Nabina', 400, 78.0, 'B')
('Anusha', 400, 78.0, 'B')
('Hari', 420, 84.0, 'A')
('Anusha', 400, 78.0, 'B')

In [24]:
# Select 
db.execute("SELECT * FROM student ORDER BY total DESC")
result =db.fetchall()
for x in result:
    print(x)

(17, 'Kabir', 99, 97, 90, 99, 90, 480, 95.0, 'A+')
(16, 'Nabin', 99, 97, 90, 99, 90, 480, 95.0, 'A+')
(2, 'Rama', 78, 87, 67, 89, 87, 450, 85.5, 'A+')
(18, 'Abhinav', 89, 80, 90, 89, 78, 426, 85.2, 'A')
(25, 'Hari', 89, 87, 90, 78, 76, 420, 84.0, 'A')
(15, 'Sabin', 89, 87, 90, 79, 80, 415, 83.0, 'A+')
(1, 'Shyam', 78, 76, 90, 67, 89, 412, 82.5, 'A')
(5, 'Shyama', 78, 60, 75, 70, 78, 410, 81.4, 'A')
(20, 'Akash', 78, 56, 90, 45, 67, 410, 79.0, 'B')
(11, 'Sagar', 89, 87, 67, 89, 76, 408, 81.6, 'A+')
(24, 'Anusha', 78, 77, 99, 88, 87, 400, 78.0, 'B')
(23, 'Nabina', 78, 77, 99, 88, 87, 400, 78.0, 'B')
(22, 'Nabin', 78, 77, 99, 88, 87, 400, 78.0, 'B')
(29, 'Anusha', 78, 77, 99, 88, 87, 400, 78.0, 'B')
(8, 'Rama', 89, 78, 89, 67, 86, 400, 80.0, 'A')
(9, 'Ram', 89, 78, 89, 67, 86, 400, 80.0, 'A+')
(10, 'Ram', 89, 78, 89, 67, 86, 400, 80.0, 'A+')
(21, 'Nabin', 89, 67, 90, 78, 56, 390, 78.0, 'B')

In [25]:
# Select 
db.execute("SELECT * FROM student ORDER BY total DESC")
result =db.fetchall()
for x in result[0:10]:
    print(x)

(17, 'Kabir', 99, 97, 90, 99, 90, 480, 95.0, 'A+')
(16, 'Nabin', 99, 97, 90, 99, 90, 480, 95.0, 'A+')
(2, 'Rama', 78, 87, 67, 89, 87, 450, 85.5, 'A+')
(18, 'Abhinav', 89, 80, 90, 89, 78, 426, 85.2, 'A')
(25, 'Hari', 89, 87, 90, 78, 76, 420, 84.0, 'A')
(15, 'Sabin', 89, 87, 90, 79, 80, 415, 83.0, 'A+')
(1, 'Shyam', 78, 76, 90, 67, 89, 412, 82.5, 'A')
(5, 'Shyama', 78, 60, 75, 70, 78, 410, 81.4, 'A')
(20, 'Akash', 78, 56, 90, 45, 67, 410, 79.0, 'B')
(11, 'Sagar', 89, 87, 67, 89, 76, 408, 81.6, 'A+')